<template>
    <div class="bill-content">
         <div class="center">
        <h4>在点击页面确认和接受本合同之前<br><br>请您仔细阅读本合同的全部内容</h4>
        <ul>
            <li>
                <h6>您务必审慎阅读、充分理解各条款内容,特别是免除或者限制责任的条款、法律适用和争议解決条款、以及其他以粗体标识重要条款。如果您不同意本合同的任意内容,或者无法准确理解本合同各条款的解释,请不要进行点击确认及后续操作,否则表示您已经确认并同意接受本合同的全部约定内容</h6>
            </li>
            <li>
                <h5>第一条 本协议的签署和修订</h5>
                <h6>只接受持有中国有效身份证明的18周岁以上具有完全民事权利和民事行为能力, 能够独立承担民事责任且資信状况良好的自然人成为网站用户。如您不符合资格,请勿注册,否则有权随时中止或終止您的用户资格。</h6>
            </li>
            <li>
                <h5>二、注册用户的要求</h5>
                <h6>1.您保证账户注册由本人办理,不存在代办、冒充他人注册等情形。您有文务在注船时按要求提供您本人的真实资料,并保证您提供的所有资料均真实、准确、完整、合法、有效,否则您需要承担因此引起的相应责任及后果, 并且信用卡产品保留中止、終止您使用信用卡产品各项服务的权利</h6>
                <h6>2.如因您未及时更新基本資料,导致信用卡产品服务无法提供或提供时发生任何错误,您不得将此作为取消貨款或拒绝通款的理由,信用卡产品亦不承担任何责任, 所有后果应由您自行承担</h6>
                <h6>3.您有义务采取风险防范措施,安全使用信用卡产品服务账户。您确认,使用用户账户和密码置随后在信用卡产品平台上的一切操作均视为您本人行为, 您账户操作所产生的电子信息记录为您行为的有效凭据, 由您本人自行承担由此产生的全部责任。</h6>
                <h6>4.您应采取有效的措施保护用于使用信用卡产品服务账户的计算机、手机等电子设备的安全,因黑客、病毒或用户的保管疏忽等非信用卡产品原因导致用户账户遭他人非法使用的, 由您本人自行承担由此产生的全部责任 。</h6>
                <h6>5.您的账户仅限本人使用,不得转借、转让、出祖或以其他方式供他人使用, 否则由此产生的风险及全部损失由您自行承担。</h6>
                <h6>6.如您发现有第三人冒用或盗用您的账户及密码,或其他任何末经合法授权的情形,应立即以有效方式通知信用卡产品,要求信用卡产品暂停相关服务,否则由此产生的一切责任由您本人承担。信用卡产品承诺在收到上述通知后尽快做出反应,但同时,您理解信用卡产品对您的请求采取行动需要合理期限,在此之前,信用卡产品对第三人使用该服务所导致的损失不承担任何责任。</h6>
            </li>
            <li>
                <h5>三、服务内容</h5>
                <h6>信用卡产品提供的服务包括但不限于: 支持信用卡还款业务，与消费金融相关的、答询和代理业务、代理销售与消费贷款相关的保险产品。您同意, 针对借款人用户, 信用卡产品有权根据借款人提供的各项信息及信用卡产品依据借款人授权或公开渠道获得的信息评估借款人在信用卡产品处的个人信用状况,进而决定是否审核通过借款人的借款申请。</h6>
            </li>
            <li>
                <h5>四、服务使用规范</h5>
                <h6>1.您保证并承诺向信用卡产品平台申请的借款款项的用途是不達反国家强制性法律法规的规定、不违背社会主文道德与公序良俗的,因此对信用卡产品造成损失的,信用卡产品有权依据本协议追究您的违约赔偿责任。</h6>
                <h6>2.如果信用卡产品发现了因系统故障或其他任何原因导致的处理描误 , 无论有利于信用卡产品还是有利于您, 信用卡产品都有权纠正该描误。</h6>
                <h6>3.信用卡产品将对您在信用卡产品平台的所有操作进行记录并在法律允许的期限内留存上述记录,不论该操作之目的最終是否实现,您可以通过账户实时査询账户名下的消费记录</h6>
            </li>
            <li>
                <h5>五、使用限制</h5>
                <h6>1.您承诺合法使用信用卡产品提供的服务及网站内容。您不得利用本服务从事侵害他人合法权益之行为,不得在信用卡产品从事任何可能违反中国的法律、法规、规章和政府规范性文件的行为或者任何未经授权的行为,如擅自进入信用卡产品的末公开的系统、不正当地使用账号密码和网站的任何内容等。</h6>
                <h6>2.信用卡产品中全部内容的版权均属子信用卡产品所有,该等内容包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片及其他全部信息(以下称“网站内容”) 。内容受中华人民共和国著作权法及国际版权公约的保护。 未经信用卡产品事先书面同意, 您承诺不以任何方式、不以任何形式复制、模仿、传播、出版、公布、展示网站内容,包括但不限子电子的、机械的、复印的、录音录像的方式和形式等。</h6>
            </li>
            <li>
                <h5>六、免责条款</h5>
                <h6>1.本服务内容可能涉及或链接到由第三方所有或者运营的其他网站(“第三方网站”) 。信用卡产品不能保证也没有义务保证第三方网站上的信息的真实性和有效性。您确认按照第三方网站的相关服务协议而非本协议使用第三方网站,第三方网站的内容、产品、广告和其他任何信息均由您自行判断并承担风险。</h6>
                <h6>2. 信用卡产品系统因下列状况无法正常运作,使您无法使用各项服务时,信用卡产品不承担损害赔偿责任,该状况包括但不限于:
                    <p>(1) 本公司在本网站公告之系统停机维护期间;</p>
                    <p>(2) 电信设备出现故障不能进行数据传输的;</p>
                    <p>(3) 因台风、地震、洪水、停电、战争、恐怖袭击等不可抗力之因素, 造成本公司系统故障无法执行业务的;</p>
                    <p>(4) 由于黑客攻击、电信部门技术调整或故障、网站升级等原因造成的服务中断或者延迟。</p>
                </h6>
            </li>
            <li>
                <h5>七、违约责任</h5>
                <h6>1.如果您违反了您在本协议中所作的陈述、保证、承话或任何其他义务,致使信用卡产品承受任何损失,您需赔偿信用卡产品的相关损失。</h6>
                <h6>2.如果由子您违反本协议或任何法律、法规而侵害第三方的权利,引起第三方对信用卡产品提出的任何形式索赔、要求、诉讼,信用卡产品有权向您追偿相关损失 。</h6>
                <h6>3.本协议项下的相关损失包括但不限于信用卡产品发生的全部损失及向第三方支付的赔偿金、诉讼費、公证費、律师費、差旅費等。</h6>
            </li>
            <li>
                <h5>八、协议终止及账户的暂停、注销或终止</h5>
                <h6>1.除非信用卡产品_終止本协议或者您申请_終止本协议且经信用卡产品同意,否则本协议始終有效,在您违反了本协议相关规则,或在相关法律法规、政府部门的要求下,信用卡产品有权通过站内信、电子邮件通知等方式終止本协议、关闭您的账户或者限制您使用信用卡产品服务。但信用卡产品的終止行为不能免除您根据本协议或在信用卡产品签订的其他协议项下还未履行完毕的义务。</h6>
                <h6>2.您决定不再使用用户账户时,应首先清偿所有应付款项(包括但不限于贷款本金、利息、可选服务费、 罚息等) ,并向信用卡产品申请注销该用户账户,经信用卡产品审核同意后可正式注销用户账户,您死亡或被宣告死亡的,您在本协议项下的各项权利义务由您的继承人依法承担,若您丧失全部或部分民事行为能力,信用卡产品有权根据有效法律文书(包括但不限于生效的法院判决等)或其法定监护人的指示处置与用户账户相关的款项。</h6>
                <h6>3. 信用卡产品有权基于单方独立判断,在认为可能发生危害交易安全等情形时,不经通知而先行暂停、中断或終止向您提供本协议项下的全部或部分服务,并将注册资料移除或删除,且无需对您或任何第三方承担任何责任,前述情形包括但不限于;
                    <p>(1) 信用卡产品认为您提供的个人资料不具有真实性、有效性或完整性;</p>
                    <p>(2) 信用卡产品发现异常交易或有疑文或有违法之虞时;</p>
                    <p>(3) 信用卡产品认为您的账户渉嫌洗钱、套现、传销、被冒用或其他信用卡产品认为有风险之情形;</p>
                    <p>(4) 信用卡产品认为您已经违反本协议中规定的各类规则及精神;</p>
                    <p>(5) 信用卡产品基于交易安全等原因,根据其単独判断需先行暂停、中断或終止向您提供本协议项下全部或部分服务, 并将注册资料移除或删除的其他情形。</p>
                </h6>
            </li>
            <li>
                <h5>十、适用法律和管辖</h5>
                <h6>因信用卡产品所提供服务而产生的争议均适用中华人民共和国法律,并由信用卡产品住所地的人民法院管辖。</h6>
            </li>
        </ul>
        <!-- <button v-if="flag">我已阅读</button> -->
        <div class="btn" @click="fun">
             <yd-sendcode
                class="a"
                v-model="start2"
                second="15"
                init-str="我已阅读"
                run-str="在{%s}秒后你就可以重新获取啦"
                reset-str="你可以重新获取验证码啦"
                size="large"
                type="primary"
            ></yd-sendcode>

        </div>
       
        </div>
    </div>
</template>
<script>
    export default {
        data() {
            return {
                start2: false
            }
        },
        created() {
           this.getTime()
        },
        beforeRouteEnter(to, from, next) {
            next(vm => {
                vm.$parent.$data.showfooter = false
                vm.$parent.$data.showmenu = false
            })
        },
        beforeRouteLeave(to, from, next) {
            this.$parent.$data.showfooter = true
            this.$parent.$data.showmenu = true
            next()
        },
        methods: {
            fun() {
                this.$router.push({
                 name: "phoneregister"
                })
            },
            getTime(){
               this.start2 = true
            }
        },
        components: {
        }
    }
</script>
<style scoped>
    .center {
        padding-top: 10px;
        padding-left: 8px;
        padding-right: 8px; 
    }
    h5 {
        color: #000;
    }
    .bill-content {
        text-align: center;
        margin: 2%; 
        background-color: #fff;
    }
    li {
        list-style-type: none;
        margin: .5em;
        text-align: left;
    }
    button {
        height: 3em;
        width: 80%;
        border: 0;
        background-color: #a2a201;
        color: #FFFFFF;
    }
    .btn{
        width: 100%;
        height: 40px;
    }
    .a{
        width: 100%;
        height: 40px;
    }
</style>

